{
    CompleterNpc: "Giselda",
    NextQuestId: -1,
    RandomReward: 0b,
    QuestRepeat: 0,
    QuestCompletion: 0,
    IgnoreNBT: 0b,
    Title: "Legendary Wolves",
    Text: "Head back to Giselda with the book of legends.",
    QuestFactionPoints: {
        DecreaseFaction1Points: 0b,
        OptionFaction2Points: 100,
        OptionFactions1: -1,
        OptionFactions2: -1,
        OptionFaction1Points: 100,
        DecreaseFaction2Points: 0b
    },
    RewardExp: 25,
    QuestCommand: "",
    ModRev: 16,
    Type: 0,
    QuestMail: {
        Sender: "",
        BeenRead: 0b,
        Message: {
        },
        MailItems: [
        ],
        MailQuest: -1,
        TimePast: 1444185777658L,
        Time: 0L,
        Subject: ""
    },
    IgnoreDamage: 0b,
    Rewards: {
        NpcMiscInv: [
        ]
    },
    Items: {
        NpcMiscInv: [
            {
                Slot: 0b,
                id: 387s,
                Count: 1b,
                tag: {
                    pages: [
                        "The legend of the werewolf is one of the most ancient and well-known legends of DragonBurg. It dates back to the first settlers in the area. The legends states that King Lycaeon was visited by passing gods. Not believing they were true gods he decided",
                        "to test them by serving human flesh in a dish served at a banquet to honor them. Upon discovering the tainted dish, the gods changed King Lycaeon into a werewolf - since he obviously liked human flesh…..",
                        "The most well-known of the werewolf legends involves a young girl, Shyla Trevil, whose sister was attacked and turned by werewolves. Shyla Trevil wandered the forests of DragonBurg searching for her sister. The villagers witnessed Shyla leaving town every",
                        "evening in a red riding hood heading into the woods. One morning, she never returned, however villagers swear they still see her in the woods to this day….",
                        "In the mountains of DragonBurg, the story is told of a royal female werewolf. In the story, a nobleman was gazing out of his window. Upon spotting a huntsman he knew, he told him to report back with the details of the hunt. While in the forest and still",
                        "within sight of the nobleman’s home, the huntsman stumbled upon a wolf. In the ensuing struggle, he severed one of the wolf’s arms and placed it in a pouch. Upon returning to the noble’s home with the gruesome prize, he opened the pouch to show the noble",
                        "evidence of his fight. they found in the pouch a woman’s arm with an elegant gold ring on a finger. The nobleman recognized the ring, sent the huntsman away, and sought for his wife. He found her in the kitchen nursing a wound on her arm. When he removed",
                        "the bandage and saw her hand had been cut off. He questioned her and she confessed to being a witch and often she would use a potion to change into a werewolf. By her confession, she marked herself for execution. Several days later she was",
                        "burned at the stake...."
                    ],
                    author: "Unknown",
                    title: "Book of Legends"
                },
                Damage: 0s
            }
        ]
    },
    LeaveItems: 1b,
    CompleteText: "That was quick!",
    NextQuestTitle: ""
}
